#### FaceIntersectionFaceResult Enumeration

---

|  |
| --- |
| See Also |

An enumerated type listing the possible results of a face-face intersection calculation.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public enum FaceIntersectionFaceResult ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration FaceIntersectionFaceResult ``` |

| Visual C++ |
| --- |
| ``` public enum class FaceIntersectionFaceResult ``` |

# Members

| Member name | Description |
| --- | --- |
| Intersecting | The two faces have an intersection. |
| NonIntersecting | The two faces have no intersection. |

# See Also

Autodesk.Revit.DB Namespace